Database

In [1]:
import sqlite3

In [2]:
dbcon=sqlite3.connect('testdatabase.db')

In [3]:
cur=dbcon.cursor()

In [4]:
cur.execute('create table student (rollno int primary key, name text, marks int )')

In [6]:
cur.execute('insert into student(rollno,name,marks) values(1,"John",90)')

In [7]:
results=cur.execute('select * from student')

for res in results:
    print(res)

(1, 'John', 90)

In [8]:
cur.execute('insert into student(rollno,name,marks) values(2,"Andrew",95)')

In [9]:
cur.execute('insert into student(rollno,name,marks) values(3,"Skyli",97)')

In [10]:
cur.execute('insert into student(rollno,name,marks) values(4,"Lee",98)')

In [11]:
cur.execute('insert into student(rollno,name,marks) values(5,"John",99)')

In [12]:
results=cur.execute('select * from student')

for i in results:
    print(i)

(1, 'John', 90)
(2, 'Andrew', 95)
(3, 'Skyli', 97)
(4, 'Lee', 98)
(5, 'John', 99)

In [13]:
cur.execute('insert into student values(6,"Lily",100)')

In [16]:
results=cur.execute('select * from student')

for i in results:
    print(i)

(1, 'John', 90)
(2, 'Andrew', 95)
(3, 'Skyli', 97)
(4, 'Lee', 98)
(5, 'John', 99)
(6, 'Lily', 100)

In [17]:
results=cur.execute('select name from student')

for i in results:
    print(i)

('John',)
('Andrew',)
('Skyli',)
('Lee',)
('John',)
('Lily',)

In [18]:
results=cur.execute('select marks from student')

for i in results:
    print(i)

(90,)
(95,)
(97,)
(98,)
(99,)
(100,)

In [19]:
results=cur.execute('select name,marks from student')

for i in results:
    print(i)

('John', 90)
('Andrew', 95)
('Skyli', 97)
('Lee', 98)
('John', 99)
('Lily', 100)

In [20]:
results=cur.execute('select rollno,name,marks from student')

for i in results:
    print(i)

(1, 'John', 90)
(2, 'Andrew', 95)
(3, 'Skyli', 97)
(4, 'Lee', 98)
(5, 'John', 99)
(6, 'Lily', 100)

In [21]:
results=cur.execute('select * from student')

for i in results:
    print(i)

(1, 'John', 90)
(2, 'Andrew', 95)
(3, 'Skyli', 97)
(4, 'Lee', 98)
(5, 'John', 99)
(6, 'Lily', 100)

In [22]:
results=cur.execute('select * from student where rollno=1')

for i in results:
    print(i)

(1, 'John', 90)

In [23]:
results=cur.execute('select * from student where rollno=2')

for i in results:
    print(i)

(2, 'Andrew', 95)

In [24]:
results=cur.execute('select name from student where rollno=2')

for i in results:
    print(i)

('Andrew',)

In [25]:
results=cur.execute('select * from student where name="John"')

results.fetchone()

(1, 'John', 90)

In [26]:
results=cur.execute('select * from student where name="Andrew"')

results.fetchone()

(2, 'Andrew', 95)

In [29]:
results=cur.execute('select * from student')

results.fetchall()

[(1, 'John', 90),
 (2, 'Andrew', 95),
 (3, 'Skyli', 97),
 (4, 'Lee', 98),
 (5, 'John', 99),
 (6, 'Lily', 100)]

In [31]:
results=cur.execute('select * from student limit 3')
results.fetchall()

[(1, 'John', 90), (2, 'Andrew', 95), (3, 'Skyli', 97)]

In [32]:
results=cur.execute('select * from student limit 4')
results.fetchall()

[(1, 'John', 90), (2, 'Andrew', 95), (3, 'Skyli', 97), (4, 'Lee', 98)]

In [33]:
results=cur.execute('select * from student order by name asc')
results.fetchall()

[(2, 'Andrew', 95),
 (1, 'John', 90),
 (5, 'John', 99),
 (4, 'Lee', 98),
 (6, 'Lily', 100),
 (3, 'Skyli', 97)]

In [34]:
results=cur.execute('select * from student order by name desc')
results.fetchall()

[(3, 'Skyli', 97),
 (6, 'Lily', 100),
 (4, 'Lee', 98),
 (1, 'John', 90),
 (5, 'John', 99),
 (2, 'Andrew', 95)]

In [36]:
results=cur.execute('select * from student where rollno in (1,2,3)')

for i in results:
    print(i)

(1, 'John', 90)
(2, 'Andrew', 95)
(3, 'Skyli', 97)

In [37]:
results=cur.execute('select * from student where name in ("Andrew","Lee","Lily")')

for i in results:
    print(i)

(2, 'Andrew', 95)
(4, 'Lee', 98)
(6, 'Lily', 100)

In [38]:
results=cur.execute('select * from student where marks between 90 and 98')

for i in results:
    print(i)

(1, 'John', 90)
(2, 'Andrew', 95)
(3, 'Skyli', 97)
(4, 'Lee', 98)